from numpy import array, set_printoptions
from utility import coef_corr, countable_nouns, find_max_correlation
# Исходные данные с 2012 года
malign = array([50.5, 50.8, 52.0, 53.7, 54.7, 55.6, 56.4, 57.4, 56.3, 57.9, 59.3, 60.5])
invest = array([655061743.4, 699948879.0, 795407850.6, 854288043.8, 873778705.8, 
                  950257084.9, 960689437.2, 1060560377.0, 1091333468.1, 1193578508.5, 1322563915.0])


results, best_shift, max_r = find_max_correlation(malign, invest)

set_printoptions(suppress=True, precision=3)

print("Анализ корреляции при разных сдвигах:")
for res in results:
    print(f"\nСдвиг: {res['shift']} {countable_nouns(res['shift'], ("год", "года", "лет"))}")
    print(f"Значения malign: {res['X_values'] * malign.std() + malign.mean()}")
    print(f"Значения invest: {res['Y_values'] * invest.std() + invest.mean()}")
    print(f"Коэффициент корреляции: {res['correlation']:.4f}")

print(f"\nМаксимальная корреляция ({max_r:.4f}) достигается при сдвиге в {best_shift} {countable_nouns(best_shift, ("год", "года", "лет"))}")

# Анализ корреляции при разных сдвигах:
# 
# Сдвиг: 0 лет
# Значения malign: [50.5 50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3]
# Значения invest: [6.551e+08 6.999e+08 7.954e+08 8.543e+08 8.738e+08 9.503e+08 9.607e+08
#  1.061e+09 1.091e+09 1.194e+09 1.323e+09]
# Коэффициент корреляции: 0.9638
# 
# Сдвиг: 1 год
# Значения malign: [50.8 52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# Значения invest: [6.551e+08 6.999e+08 7.954e+08 8.543e+08 8.738e+08 9.503e+08 9.607e+08
#  1.061e+09 1.091e+09 1.194e+09 1.323e+09]
# Коэффициент корреляции: 0.9681
# 
# Сдвиг: 2 года
# Значения malign: [52.  53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# Значения invest: [6.551e+08 6.999e+08 7.954e+08 8.543e+08 8.738e+08 9.503e+08 9.607e+08
#  1.061e+09 1.091e+09 1.194e+09]
# Коэффициент корреляции: 0.9806
# 
# Сдвиг: 3 года
# Значения malign: [53.7 54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# Значения invest: [6.551e+08 6.999e+08 7.954e+08 8.543e+08 8.738e+08 9.503e+08 9.607e+08
#  1.061e+09 1.091e+09]
# Коэффициент корреляции: 0.9536
# 
# Сдвиг: 4 года
# Значения malign: [54.7 55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# Значения invest: [6.551e+08 6.999e+08 7.954e+08 8.543e+08 8.738e+08 9.503e+08 9.607e+08
#  1.061e+09]
# Коэффициент корреляции: 0.9466
# 
# Сдвиг: 5 лет
# Значения malign: [55.6 56.4 57.4 56.3 57.9 59.3 60.5]
# Значения invest: [6.551e+08 6.999e+08 7.954e+08 8.543e+08 8.738e+08 9.503e+08 9.607e+08]
# Коэффициент корреляции: 0.8706
# 
# Максимальная корреляция (0.9806) достигается при сдвиге в 2 года

  